console.log(document.getElementById('content').innerText);
console.log(document.getElementById('rules').innerText);
document.getElementById('content').innerText = '«Я парень, у которого есть всё, – говорил он в интервью журналу Rolling Stone в 1999 году, году, когда фильм вышел на экраны. – Но я вам говорю, когда ты получишь всё, тогда просто останешься сам с собой. Я говорил это раньше и скажу снова: это не помогает лучше спать или легче просыпаться».'
document.getElementById('rules').innerText = `Первое правило Бойцовского клуба: никому не рассказывать о Бойцовском клубе.
                                            Второе правило Бойцовского клуба: никогда никому не рассказывать о Бойцовском клубе.
                                            Третье правило Бойцовского клуба: в схватке участвуют только двое.
                                            Четвертое правило Бойцовского клуба: не более одного поединка за один раз.
                                            Пятое правило Бойцовского клуба: бойцы сражаются без обуви и голые по пояс.
                                            Шестое правило Бойцовского клуба: поединок продолжается столько, сколько потребуется.
                                            Седьмое правило Бойцовского клуба : если противник потерял сознание или делает вид, что потерял, или говорит «Хватит» — поединок окончен.
                                            Восьмое и последнее правило Бойцовского клуба : новичок обязан принять бой.`

